{
	"battlesim": [
		{
			"Title": "Cannot Simulate Battle",
			"Body": "One or both Pokemon inputs were incorrect. Select from the provided list and try again."
		},
		{
			"Title": "Cannot Simulate Battle",
			"Body": "**{0}** is not a spawnable Pokemon that you can fight. Use **/help spawn** for more information."
		}
	],
	"daycare": [
		{
			"Title": "Daycare Empty",
			"Body": "<@{0}> has no Pokemon currently in their daycare."
		},
		{
			"Title": "Daycare Empty",
			"Body": "You have no Pokemon currently in your daycare. To add a Pokemon, specify the 'pokemon' parameter when running this command."
		},
		{
			"Title": "Cannot Add To Daycare",
			"Body": "You already have two Pokemon in the daycare. Run this command without specifying a Pokemon to remove one, then try again."
		},
		{
			"Title": "Cannot Add To Daycare",
			"Body": "You do not own any **{0}** to add to the daycare. Try again."
		}
	],
	"evolve": [
		{
			"Title": "Cannot Evolve",
			"Body": "You have no Pokemon in your party that are able to evolve. Learn how to evolve Pokemon using **/pokedex** on the last page."
		}
	],
	"givecandy": [
		{
			"Title": "No Candies",
			"Body": "You do not have any candies to give to your Pokemon. You can find them from fighting wild Pokemon with **/spawn**."
		},
		{
			"Title": "No Available Pokemon",
			"Body": "All Pokemon in your party are Level 100! Switch them out to lower levels using **/modifyteam** and try again."
		}
	],
	"hatch": [
		{
			"Title": "Nothing To Hatch",
			"Body": "None of your eggs are ready to hatch. Use the **/spawn** command to prep them and check their status through **/myeggs**."
		},
		{
			"Title": "No Eggs",
			"Body": "You currently do not own any eggs. To claim an egg, use the **/daily** command that resets every day at midnight UTC."
		}
	],
	"learnmove": [
		{
			"Title": "Not Enough Funds",
			"Body": "It cost $500 to teach a new move without using a TM. Earn money by battling wild Pokemon or trainers."
		},
		{
			"Title": "Invalid Pokemon",
			"Body": "The Pokemon you are looking for does not exist or is not part of your team. Please use the provided parameters and try again."
		},
		{
			"Title": "No Moves",
			"Body": "{0} already knows every move it is able to learn! Level up to unlock more moves and try again."
		}
	],
	"pokeinfo": [
		{
			"Title": "No Results",
			"Body": "There seem to be no Pokemon categorized under the type **{0}**. Try again using the given prompts and filters."
		}
	],
	"spawn": [
		{
			"Title": "Failed To Spawn",
			"Body": "Something went wrong trying to spawn a Pokemon. This interaction still went towards any egg progress you may have."
		},
		{
			"Title": "Cannot Fight",
			"Body": "You do not have any Pokemon available to fight! Visit the **/pokecenter** to heal and try again."
		}
	],
	"spawnlegendary": [
		{
			"Title": "Cannot Find A Legendary",
			"Body": "You have not completed the gym challenge for this region! Defeat all Gym Leaders through **/gymbattle** and try again."
		},
		{
			"Title": "Cannot Find A Legendary",
			"Body": "You have already captured a Legendary Pokemon in this region! Defeat the Elite Four through **/elitefour** to be able to find more."
		},
		{
			"Title": "Cannot Find A Legendary",
			"Body": "You have already captured all Legendary Pokemon in this region! Swap to another region to find more."
		}
	],
	"usepotion": [
		{
			"Title": "No Potions",
			"Body": "You do not have any potions available for use! Visit the **/shop** to buy more."
		}
	],
	"usetm": [
		{
			"Title": "No TM Found",
			"Body": "You do not own the TM specified! Use the paramaters provided and try again."
		},
		{
			"Title": "Cannot Use TM",
			"Body": "You cannot use this TM on any Pokemon in your team. They all either already know the move, or cannot learn it."
		}
	]
}