{
  "General":"__**GENERAL INFO**__\n\nPokeTrainer is a discord bot that is meant to be a fun and competitive Pokemon collecting experience. Server admins may enable this bot across different channels within a server, and every so often a Pokemon will spawn for any user to capture (within the right requirements). Trainers may collect Pokemon, trade with other trainers, and even participate in events for gym badges and legendary Pokemon. There are a variety of commands and interactions for trainers to enjoy, which will be listed in further detail in the lower sections. Thank you for using PokeTrainer!",
  "Gameplay":"__**GAMEPLAY**__\n\nEvery so often a Pokemon will spawn in a possibly random channel within the server. There will be four reactions for a trainer to interact with when a Pokemon spawns:\n🔴 🔵 🟡 ⚔️\nEach of these correspond to, respectively, a Pokeball, Great ball, Ultra ball, and Fight. If the trainer reacts with a *Ball*, they attempt to catch the Pokemon.\n\n__Capturing__\nTrainers own an inventory of Pokeballs (among other items), and must use them to capture a Pokemon. **Only one** user may catch a spawned Pokemon. Reacting with a ball you do not possess will result in a failed attempt (and a DM will be sent).\nThe chosen ball for the attempt will give the trainer a varied chance to catch the ball, the odds of capture increasing with ball strength. A failed attempt will use the ball, but the trainer may keep trying if they wish.\n\nNo Pokemon is safe! Any trainer may react to any Pokemon, but keep in mind your inventory counts!\n\nAnd of course, there is always the rare chance at a ✨shiny✨!\n\n__Fighting__\nTrainers have a set HP assigned to them, maxing at 100. Reacting with *Fight* will give you the chance to win some money based on the Pokemon's rarity, while using 5 of your current HP. All users may fight the spawned Pokemon just once. as long as they have the HP to do so. You may refill your HP by buying and using Potions from the store.",
  "Commands":"__**COMMANDS**__\n\nThis is a list of commands and a simplified description. For further details on each command, try using **/help *command***\n\n__Admin Only Commands__\n**/start *percent***: Registers this server with the PokeTrainer bot.\n**/stop**: Deregisters this server from the PokeTrainer bot.\n**/togglechannel**: Adds the current channel to the random spawn cycle.\n**/getserver**: Prints the current server settings.\n**/testspawn**: Spawns a random pokemon in the current channel. Cannot be caught.\n\n\n__Trainer Commands__\n**/trainerinfo**: Displays basic information about the current or given user.\n**/inventory**: Send a DM of the users inventory.\n**/pokedex**: Displays the current or given users Pokedex.\n\n\n__Shop Commands__\n**/shop**: Displays available shop items and prices.\n**/buypokeball *pokeball***: Activates the shop to buy the specified Pokeball\n**/buypotion *potion***: Activates the shop to buy the specified Potion\n**/sellpokeball *pokeball***: Activates the shop to sell the specified Pokeball\n**/sellpotion *potion***: Activates the shop to sell the specified Potion\n\n\n__Pokemon Commands__\n**/pokemoninfo *pokemon***: Displays the spawn information of the given Pokemon.",
  "NotYet":"__**NOT YET IMPLEMENTED**__\n\n**~trade *@user* *pokemon***: Initiates a trade between the current and given user.\n**~release *name* *integer***: Releases the given Pokemon. Either the number is provided, or the maximum of the owned Pokemon (if less) will be released.\n**/badges *[user]***: Displays the current or given users badge list."
}