[
  "__**SUMMARY**__\n\nPokeTrainer is a discord bot that is meant to be a fun and competitive Pokemon collecting experience. Server admins may enable this bot across different channels within a server, and every so often a Pokemon will spawn for any user to capture (within the right requirements). Trainers may collect and fight Pokemon, trade with other trainers, and even participate in events for gym badges and legendary Pokemon. There are a variety of commands and interactions for trainers to enjoy, which will be listed in further detail in the lower sections. To begin your journey, use the **/starter** command and claim your first Pokemon! Thank you for using PokeTrainer!",
  "__**SPAWNING**__\n\nEvery so often a Pokemon will spawn in a possibly random channel within the server. There will be four reactions for a trainer to interact with when a Pokemon spawns:\n🔴 🔵 🟡 ⚔️\nEach of these correspond to, respectively, a Pokeball, Great ball, Ultra ball, and Fight. If the trainer reacts with a *Ball*, they attempt to catch the Pokemon, while fight means they will attempt to...well, fight it! Every Pokemon has a certain spawn, detail, and ✨shiny✨ rate, which can be further explained using **/help spawns** command.\n\n__Capture__\nTrainers own an inventory of different Pokeballs and must use them to capture the spawned Pokemon by reacting with the presented emojis. **Only one** user may catch a spawned Pokemon. The chosen ball for the attempt will give the trainer a varied chance to catch the Pokemon, the odds of capture increasing with ball strength. There are two types of failed attempts that will remove the users reaction: Reacting with a ball you do not possess, or using a valid ball but failing the capture attempt.\n\nNo Pokemon is safe! Any trainer may react to any Pokemon, but keep in mind your inventory counts! More information can be found using the **/help capture** command.\n\n__Fighting__\nTrainers have a set HP assigned to them, maxing at 100. Reacting with *Fight* will use some HP, but give the user a chance to win money and have their Pokemon gain experience. All users may fight the spawned Pokemon just once, as long as they have at least 1 HP. You may refill your HP by buying and using Potions from the store. For more details on fights, use the **/help fight** command.",
  "__**TRAINERS**__\n\nTrainers in PokeTrainer have a number of different attributes that can be viewed and modified. In greater detail below, trainers can interact with their: inventory, Pokedex, battle team, badges, and statistics. Each trainer is unique per server, so all data seen in one server is most likely completely different than another!\n\n__Inventory__\nEach trainer will have an inventory of items at their disposal when interacting with PokeTrainer, seen by the **/inventory** command. As of now, there are only two types of items: Pokeballs and Potions. Both of these items can be bought and sold through the shop using the **/buy** command and **/sell** command.\n\nPokeballs are used when capturing wild Pokemon, and there are three different types: Pokeball, Greatball, and Ultraball. Each ball gives the trainer a different chance of capturing the Pokemon which can be seen using the **/help capture** command.\n\nPotions are used to replenish a trainers HP after battling wild Pokemon. Potions will only be used when the trainer is missing HP, and there are three types: Potion (10HP), Super Potion (40HP), Hyper Potion (80HP), and Max Potion (100HP).\n\n__Pokedex__\nA trainers Pokedex consists of all the Pokemon they have obtained throughout their journey. There are many filters and orderings a user can search by when viewing the Pokedex which can further be explained through the **/help pokedex** command. A user is able to search through any trainers Pokedex, but they are never able to modify it. You can view the Pokedex by just a list of names, or pages of images if you choose!\n\n__Battle Team__\nYour team is how you battle your way through challenges in PokeTrainer. Your team consists of six slots in which you can place/replace Pokemon at your discretion by using the **/modifyteam** command. Your team will always enter battle starting with the first slotted Pokemon, but there are differences between wild battles and gym battles seen through the **/help fight** command.\n\n__Badges__\nAs you go through your journey, you may battle all gym leaders from every region! Battle a gym leader by using the **/gymbattle** command, and obtain the gym badge when victorious. Obtained badges can be seen through the **/badges** command, and a count can be seen through the **/trainer** command. Gym battle descriptions can be seen through the **/help fight** command. Be sure to collect as many as you can, there may be certain rewards along the way!\n\n__Statistics__\nTrainer statistics are a simple way of viewing how a trainers journey has come along since they began. Small details can be seen using the **/trainer** command such as: current HP, wild battle count, gym battles won and lost, Pokedex completion, current number of Pokemon owned, and total Pokemon caught. You can view any trainers information within the server.",
  "__**COMMANDS**__\n\nThis is a list of commands and a simplified description. For further details on each command, try using the **/help** sub commands.",
  "__**NOT YET IMPLEMENTED**__\n\n**~trade *@user* *pokemon***: Initiates a trade between the current and given user.\n**~release *name* *integer***: Releases the given Pokemon. Either the number is provided, or the maximum of the owned Pokemon (if less) will be released.\n**/badges *[user]***: "
]