[
  "__**SUMMARY**__\n\nPokeTrainer is a discord bot that is meant to be a fun and competitive Pokemon collecting experience. Users may begin their journey with a starter, spawn Pokemon to capture or fight, go through the Pokemon League, and expand their collection of Pokedex entries and Badges. There are a variety of commands and interactions for trainers to enjoy, which will be listed in further detail in the lower sections. To begin your journey, use the **/starter** command and claim your first Pokemon! You can always use **/help [command]** for further details of certain interactions. Thank you for using PokeTrainer!",
  "__**FIGHTING**__\n\nTrainers may trigger a spawn using the **/spawn** command, or battle a trainers through **/gymbattle** or **elitefour**. A fight will ensue based primarily on the mainstream games. You will have the ability to attack, use items, swap out Pokemon, or run away (wild battles only).\n\nYou can find more details about spawning wild Pokemon using the **/help spawn** command, but here is a minor glimpse of what it entails. Every spawned Pokemon can range in height/weight/level and of course has a chance to be ✨shiny✨. Trainers own an inventory of different Pokeballs and must use them to capture spawned Pokemon.\n\nThe Gym and Elite Four Challenge are the main ways to progress through PokeTrainer and unlock certain regions and commands. For each victory through the gym stages, you will receive rewards and unlock higher levels and better spawns. To move to another region, you must complete the Gym and Elite Four challenges.",
  "__**TRAINERS**__\n\nTrainers in PokeTrainer have a number of different attributes that can be viewed and modified. In greater detail below, trainers can interact with their: inventory, stats, Pokemon, and badges. Each trainer is unique per server, so all data seen in one server is most likely completely different than another!\n\n__Inventory/Stats__\nEach trainer will have an **/inventory** of items at their disposal when interacting with PokeTrainer, as well as a few statistics of their interactions seen through the **/trainer** command. Your inventory will consist of: Pokeballs, Potions, Candy, Evolution Items, and TMs. Most items can be bought and sold through the shop. You can use **/viewshop** to see prices and what is available. Candy can be found by defeating wild Pokemon, but cannot be bought or sold. Some statistics on the **/trainer** page include statistics such as HP and current region, completion percentage such as Pokedex/Formdex/Shinydex and badges, mission status, and other interactions. \n\n__Pokemon__\nA trainers Pokemon storage consists of all the Pokemon they have obtained throughout their journey. There are many filters and orderings a user can search by when viewing the **/mypokemon** which can further be explained through the **/help mypokemon** command. Your true Pokedex completion can be seen through **/pokedex**, and will be built as you obtain a Pokemon through either capture, evolution, trade, or eggs.\n\n__Battle Team__\nYour team is how you battle your way through challenges in PokeTrainer. A team consists of six slots in which you can place/replace Pokemon at your discretion by using the **/modifyteam** command. How your team interacts in battle can be seen through the **/help fight** command."
]