[
  "__**SUMMARY**__\n\nPokeTrainer is a discord bot that is meant to be a fun and competitive Pokemon collecting experience. Users may begin their journey with a starter, spawn their own Pokemon to capture, fight gym leaders, and expand their collection of Pokedex entries and Badges. If your server is registered by an admin, there is even a chance for events to collect legendary Pokemon and rare items! There are a variety of commands and interactions for trainers to enjoy, which will be listed in further detail in the lower sections. To begin your journey, use the **/starter** command and claim your first Pokemon! Thank you for using PokeTrainer!",
  "__**SPAWNING**__\n\nTrainers may trigger a spawn using the **/spawn** command. There will be four buttons for them to interact with when a Pokemon spawns:\n🔴 🔵 🟡 ⚔️\nEach of these correspond to, respectively, a Pokeball, Great ball, Ultra ball, and Fight. If the trainer uses a *Ball*, they attempt to catch the Pokemon, while *Fight* means they will attempt to...well, fight it! Every spawned Pokemon can range in height/weight/level and of course has a chance to be ✨shiny✨, which can be further explained using **/help spawns** command.\n\n__Capture__\nTrainers own an inventory of different Pokeballs and must use them to capture the spawned Pokemon by pressing one of the buttons with a ball emoji. Depending on the level of the spawn, each ball will have a catch rate that increases with the ball level. On a failure, you may try again with the same or a different ball, but keep in mind your inventory! More information can be found using the **/help capture** command.\n\n__Fighting__\nTrainers have a set HP assigned to them, starting at 50 and maxing out at 100. Choosing to *Fight* will always use some HP, but give the user a chance to win money and have their Pokemon gain experience. The HP lost varies depending on the matchup between the first Pokemon in your team and the spawned Pokemon. You may refill your HP by buying and using Potions from the store. For more details on wild fights, use the **/help fight** command.",
  "__**TRAINERS**__\n\nTrainers in PokeTrainer have a number of different attributes that can be viewed and modified. In greater detail below, trainers can interact with their: inventory, stats, Pokedex, battle team, and badges. Each trainer is unique per server, so all data seen in one server is most likely completely different than another!\n\n__Inventory/Stats__\nEach trainer will have an inventory of items at their disposal when interacting with PokeTrainer, as well as a few statistics of their interactions seen through the **/trainer** command. As of now, there are only two types of inventory items: Pokeballs and Potions. Both of these items can be bought and sold through the shop using the **/shop** command. Some statistics you will see include Pokedex completion, shiny count, and badge completion.\n\n__Pokedex__\nA trainers Pokedex consists of all the Pokemon they have obtained throughout their journey. There are many filters and orderings a user can search by when viewing the Pokedex which can further be explained through the **/help pokedex** command. Your true Pokedex completion will be maintained as you own a Pokemon through either capture or evolution, but the **/pokedex** command will only show what you currently own.\n\n__Battle Team__\nYour team is how you battle your way through challenges in PokeTrainer. A team consists of six slots in which you can place/replace Pokemon at your discretion by using the **/modifyteam** command. How your team interacts in battle can be seen through the **/help fight** command."
]