{
  "Server": [
    {
      "Name": "register",
      "ShortString": "(Admin Only) Registers this server with the PokeTrainer bot.",
      "HelpString": "Proper command usage: **/register**\n\nWhen this command is run, the current channel will be marked as the notification channel. This means any notifications from PokeTrainer will be sent to this channel. Events will also return and appear in this channel as well. If you wish to change which channel is registered, just run the command again in the desired channel.\n\nNOTE: For PokeTrainer to work properly in your server, it must be given the following permissions:\n- Manage Webhooks\n- Send Messages\n- Send/Create/Manage Threads\n- Embed Links\n- Add Reactions\n- Manage Messages\n- Read Message History",
      "RequiresAdmin": true
    },
    {
      "Name": "server",
      "ShortString": "(Admin Only) Prints the current server settings.",
      "HelpString": "Proper command usage: **/server**\n\nThis command will return the details of the server settings for the bot. This includes the server name, registered notification channel, and the current event taking place (if applicable).",
      "RequiresAdmin": true
    },
    {
      "Name": "unregister",
      "ShortString": "(Admin Only) Unregister this server from the PokeTrainer bot events.",
      "HelpString": "Proper command usage: **/unregister**\n\nThis command will remove your server from being able to receive notifications. If you wish to receive notifications again, look into the **/register** command.\n\nTrainers will still be able to interact with PokeTrainer as long as it is in the server, regardless of registration.",
      "RequiresAdmin": true
    },
    {
      "Name": "invite",
      "ShortString": "Invite PokeTrainer to another server!",
      "HelpString": "Proper command usage: **/invite**\n\nThis command will provide a link that allows anyone to invite PokeTrainer to another discord server. In order to add bots to servers, you must be an admin/owner of the server.",
      "RequiresAdmin": false
    }
  ],
  "Trainer": [
    {
      "Name": "starter",
      "ShortString": "Begin your PokeTrainer journey in any region.",
      "HelpString": "Proper command usage: **/starter *[starter]***\nParameters:\n**starter** - The Pokemon you wish to start with in your next journey.\n\nThis command will be used to select a starter Pokemon from any of the 9 regions. Once you have selected your starter for a region, you can only obtain the others of that same regions by **/trade**, so choose carefully!\n\nThis command will also move you into that region. Use **/changeregion** to move to any other available region you have unlocked.",
      "RequiresAdmin": false
    },
    {
      "Name": "badges",
      "ShortString": "Displays a list of your obtained badges.",
      "HelpString": "Proper command usage: **/badges *[region]* *[images]* *[@user]***\nParameters:\n**region** - (Optional) The region in which to filter your badge list.\n**images** - (Optional) Display badge images instead of a list.\n**@user** - (Optional) View another server members badge progress.\n\nThis command is used to display the current badge progress of either the specified user, or the user issuing the command. This will only display a list of obtained badges, which can be filtered by region (Kanto, Johto, etc.) and displayed in an image or text-based format. By default, the list displays in a text-based order of gyms by region (i.e. Boulder, Cascade, Thunder, etc.). To obtain more badges, use the **/gymbattle** command to fight the Gym Leaders.",
      "RequiresAdmin": false
    },
    {
      "Name": "changeregion",
      "ShortString": "Change the region you are exploring.",
      "HelpString": "Proper command usage: **/changeregion *[region]***\nParameters:\n**region** - The region in which to move to and explore.\n\nThis command is used to change a trainers region when **/spawn**ing wild Pokemon and fighting Gym Leaders. You may only swap to regions that you have completed, or the one you are currently progressing through.",
      "RequiresAdmin": false
    },
    {
      "Name": "daily",
      "ShortString": "Claim a small reward every day.",
      "HelpString": "Proper command usage: **/daily**\n\nThis command gives the user 10 Pokeballs and $200 every day, resetting at mignight UTC. It will also give a link to upvote the bot on top.gg and a link to the PokeTrainer discord server!",
      "RequiresAdmin": false
    },
    {
      "Name": "delete",
      "ShortString": "Delete your PokeTrainer data.",
      "HelpString": "Proper command usage: **/delete**\n\nThis command is used to remove all data related to this trainer within the current server. The user can always run **/starter** to begin their journey again!",
      "RequiresAdmin": false
    },
    {
      "Name": "inventory",
      "ShortString": "Page-by-page display of owned items.",
      "HelpString": "Proper command usage: **/inventory**\n\nThis command displays five different categories of items in the users inventory in a list based format:\n- Pokeballs\n- Potions\n- Candy\n- Evolution Items\n- TMs",
      "RequiresAdmin": false
    },
    {
      "Name": "modifyteam",
      "ShortString": "Add or replace a member of your battle team.",
      "HelpString": "Proper command usage: **/modifyteam *[pokemon]***\nParameters:\n**pokemon** - (Optional) Name of Pokemon to add to the team.\n\nThis command has two operations and may bring up two dropdowns.\n\nThe first operation happens when you do not provide a name with the command. This is treated as modifying just your existing team members. One example is you wish to change which Pokemon is in your first team slot for battles. In this case, the first selection dropdown will consist of only your team members. It will contain their expanded name (gender and shiny included) as well as all other relevant stats. The second selection will be your current team alignment. This will tell you what Pokemon is currently in which slot. You may choose a slot to replace with the selected team member, or there will be an option to remove the selected member entirely.\nNOTE: You must always have at least one Pokemon in your battle team.\n\nThe second operation is providing the *pokemon* filter when issuing the command. This is used to add a Pokemon from your box to the team either by addition or replacement. With this command path, there will still be two selection dropdowns. However, this time the first selection will only be Pokemon not currently in your team that were selected through the parameter. The selection choices will contain information about the Pokemon such as their expanded name (gender and shiny included) as well as all other relevant stats. The second selection will contain all current team members with their details as well. If the current team is not full (6 members), there will be an additional selection named 'Add To End Slot', which will do exactly as it says. You may choose a current team member and replace them in that slot, or add the selected Pokemon to the last available slot on your team (if applicable).",
      "RequiresAdmin": false
    },
    {
      "Name": "myeggs",
      "ShortString": "View your current egg list in list or image format.",
      "HelpString": "Proper command usage: **/myeggs *[images]***\nParameters:\n**images** - (Optional) Display egg images instead of a list.\n\nThis command will display the eggs currently in your bag. Information displayed on each page can contain their name, region, and the current hatch progress. A ✅checkmark will be placed next to any eggs that are ready to hatch.\n\nIf an egg is ready to hatch, you may press the 'Hatch' button, and it will give you the Pokemon at Level One. Look into **/help breeding** for more information on eggs.",
      "RequiresAdmin": false
    },
    {
      "Name": "myteam",
      "ShortString": "View your current battle team in detailed image format.",
      "HelpString": "Proper command usage: **/myteam**\n\nThis command will display your current battle team in the order of slot placement. Information displayed on each page will contain their level, experience, nature, IV sum, height/weight, typing, and IV-based stats. It will also show what Pokeball it was caught in at the bottom. To change your team, use the **/modifyteam** command.",
      "RequiresAdmin": false
    },
    {
      "Name": "mypokemon",
      "ShortString": "Displays the current or given users owned Pokemon.",
      "HelpString": "Proper command usage: **/mypokemon *[@user]* *[pokemon]* *[type]* *[images]* *[order]* *[shiny]* *[legendary]* *[gender]***\nParameters:\n**@user** - (Optional) View another server members list.\n**pokemon** - (Optional) Only show this Pokemon.\n**type** - (Optional) Only show Pokemon with this type.\n**images** - (Optional) Whether the list should be shown in image format.\n**order** - (Optional) How the list should be ordered.\n**shiny** - (Optional) Choose if shiny Pokemon are specially sorted.\n**legendary** - (Optional) Choose to show or exclude Legendary/Mythicals.\n**gender** - (Optional) Choose to only show Male/Female.\n\nThis command will display the current (or given) users current Pokemon collection in a text list form by default. Using the options above, you can format and change the returned list to your liking.\n\n__Examples__\n**/mypokemon images:Yes** - Display the current (or given) users Pokemon in a carousel image format with default ordering and no special shiny sorting.\n\n**/mypokemon order:Name shiny:Shiny First** - Display Pokemon in a text list and sort the list by name. Shiny Pokemon will be displayed and sorted by name at the front of the list.\n```Gloom✨\nVulpix✨\nAbra\nBlaziken\nZubat```\n\n**/mypokemon  order:National Dex shiny:Shiny Only** - Displays the list in sorted order by National Dex number and only displays shiniy Pokemon.",
      "RequiresAdmin": false
    },
    {
      "Name": "release",
      "ShortString": "Release one or many of the selected Pokemon.",
      "HelpString": "Proper command usage: **/release *pokemon***\nParameters:\n**pokemon** - Name of the Pokemon species you own that you wish to release.\n\nThis command will bring up a single dropdown listing all variations of the selected Pokemon outside of your set team. The selection list will contain a maximum of 25 Pokemon, so if you own 30 Pidgeys it will display the first 25 in your box. You may select one, a few, or all Pokemon listed.\n\n**NOTE:** You cannot release a Pokemon currently in your team or the daycare.",
      "RequiresAdmin": false
    },
    {
      "Name": "resettrainer",
      "ShortString": "Reset your trainer progress (maybe for shiny starter hunting).",
      "HelpString": "Proper command usage: **/resettrainer *starter***\nParameters:\n**starter** - Pokemon you wish to restart with.\n\nThis command will offer to reset your trainer progress and stats. It will clear your badges, inventory, Pokemon box, and any region completion. You may choose any starter to receive as your 'new' starter Pokemon.\n\nIt will give you the option to keep any shiny Pokemon you may have obtained, although they will not count toward your Pokedex progress, will be reset to Level 1, and will revert back to their initial stage (if applicable).",
      "RequiresAdmin": false
    },
    {
      "Name": "trainer",
      "ShortString": "Displays information about the current or given trainer.",
      "HelpString": "Proper command usage: **/trainer *[@user]***\nParameters:\n**@user** - (Optional) View another server members trainer.\n\nThis command will give stats and completion progress for the trainer belonging to either yourself or the specified user. Information will be split into 4 different categories:\n- Base Information\n- Pokedex Completion\n- Eggs/Daycare\n- Region Completion\nBase Information will contain information such as current region, missions, daily command status, simple completion progress, simple eggs/daycare usage.\nPokedex Completion will contain specific Pokedex completion and percentages for lists such as Pokedex, Form Dex, Shiny Dex, and Living Dex.\nEggs/Daycare currently has Egg and Daycare usage information.\nRegion pages will give you your badge progress, champion status, and Pokedex completion for that region.",
      "RequiresAdmin": false
    }
  ],
  "Gym": [
    {
      "Name": "elitefour",
      "ShortString": "Begin or continue your Elite Four gauntlet.",
      "HelpString": "Proper command usage: **/elitefour**\n\nThis command will either begin or continue your Elite Four Gauntlet challenge. During this challenge, some commands will be locked until you either fail or complete the challenge. You may also exit the challenge using **/exitelitefour**, but then you must restart next time you enter the Elite Four. Once you have defeated the gauntlet and became Champion, you can unlock the next region and choose a new **/starter**!\n\nMore information about fights can be seen through **/help fight**.",
      "RequiresAdmin": false
    },
    {
      "Name": "exitelitefour",
      "ShortString": "Leave your current Elite Four gauntlet.",
      "HelpString": "Proper command usage: **/exitelitefour**\n\nIf you are currently challenging an Elite Four gauntlet, this will allow you to leave and unlock previously locked commands. To restart the challenge, use **/elitefour**.",
      "RequiresAdmin": false
    },
    {
      "Name": "gymbattle",
      "ShortString": "Fight a Gym Leader in your current region.",
      "HelpString": "Proper command usage: **/gymbattle *gymleader***\nParameters:\n**gymleader** - Which Gym Leader you wish to challenge.\n\nThis command will start a Pokemon battle with the Gym Leader specified. This can be a rematch battle, or the next Gym Leader on your journey.\n\nEvery Gym Leader will have a **Level Limit** for Pokemon you can use against them. This will be equal to the nearest 10s number of their highest level Pokemon, rounded up.\n\nRematch fights will provide the user with the same Money reward, but only half the XP for defeating team members.\n\nThe fight will consist of the current trainers team, which can be modified through **/modifyteam**, and the Gym Leaders team. You may see information about any gym leader by using the **/gyminfo** command. In order for the challenge to be accepted, you must have at least one Pokemon able to battle (HP > 0), and all Pokemon in your team under the Level Cap. Each Gym Leader will have **3 Full Restores** in their inventory.\n\nWhen challenge is accepted for a gym to battle, there is a chance for experience, money, and a gym badge. The gym battle will start from the first slot of each team.\n\nMore information about fights can be seen through **/help fight**.",
      "RequiresAdmin": false
    },
    {
      "Name": "gyminfo",
      "ShortString": "Display information about a specified Gym Leader.",
      "HelpString": "Proper command usage: **/gyminfo *gymleader***\nParameters:\n**gymleader** - Which Gym Leader to show information.\n\nThis command provides the trainer information about any Gym Leader in PokeTrainer. The default information given is a image of the gym leader, their badge, the type of gym they are, and the reward for defeating them. If you have already attempted to battle the gym leader, there will be other pages available that display their battle team and the moves they use.\n\nNOTE: You may also filter by region when running the command.",
      "RequiresAdmin": false
    }
  ],
  "Trade": [
    {
      "Name": "trade",
      "ShortString": "Trade Pokemon between two users.",
      "HelpString": "Proper command usage: **/trade *user* *give* *receive***\nParameters:\n**user** - Target user to trade with.\n**give** - Pokemon you wish to trade away.\n**receive** - Pokemon you wish to receive.\n\nThe **/trade** command is a simple interaction that allows trainers to trade a single Pokemon between each other. You will input the user to trade with, the name of what you wish to give up, and the name of what you wish to receive.\n\nTwo selection boxes will show up, one for the specific Pokemon to give away, and one for the specific Pokemon to receive in the trade.\n__NOTE__: Pokemon currently in a team/daycare can NOT be traded.\n\nOnce the trade is submitted, a ping message will be sent asking the target user if they accept the trade, showing details of each Pokemon selected. If the target user accepts, the Pokemon are traded and the Pokedex of each user is updated.",
      "RequiresAdmin": false
    }
  ],
  "Shop": [
    {
      "Name": "buy",
      "ShortString": "Purchase an item from the shop.",
      "HelpString": "Proper command usage: **/buy *item* *amount***\nParameters:\n**item** - Item you wish to purchase.\n**amount** - How many to purchase.\n\nIf the user has enough money for at least one of the selected item, the sale will go through. If the user specifies a higher amount than they can afford, it will only purchase the maximum that they are allowed to with their current funds.",
      "RequiresAdmin": false
    },
    {
      "Name": "viewshop",
      "ShortString": "View the shop and items available.",
      "HelpString": "Proper command usage: **/viewshop**\n\nProvides the trainer with a list of items available for sale within the PokeTrainer shop. You are able to page through the different categories, sorted by purchase price (Name for TMs). The shop will contains a list with the item Name, Purchase Price (if applicable), and Selling Price. You can use **/buy** and **/sell* to perform a sale.",
      "RequiresAdmin": false
    },
    {
      "Name": "sell",
      "ShortString": "Sell an item to the shop.",
      "HelpString": "Proper command usage: **/sell *item* *amount***\nParameters:\n**item** - Item you wish to sell.\n**amount** - How many to sell.\n\nIf the user has at least one of the selected item, the sale will go through. If the user specifies a higher amount than they own, it will only sell the maximum that they are allowed to with their current inventory.",
      "RequiresAdmin": false
    }
  ],
  "Pokemon": [
    {
      "Name": "daycare",
      "ShortString": "Up to two Pokemon will gain passive experience over time.",
      "HelpString": "Proper command usage: **/daycare *[pokemon]***\nParameters:\n**pokemon** - (Optional) Pokemon you wish to add to the daycare.\n\nDaycare is another way for your Pokemon to gain experience and a way for you to obtain eggs through **/breeding**. This is a passive gain that is purely time-based, gaining **1 XP every minute** that they are in the Daycare.\n\nYou may only have up to two Pokemon stored in the Daycare at a time. You may add a Pokemon to the Daycare by specifying what Pokemon to add while running the command. To check on and remove Pokemon from the Daycare, run the command without any specifications.",
      "RequiresAdmin": false
    },
    {
      "Name": "evolve",
      "ShortString": "Evolve one of your Pokemon that are eligible.",
      "HelpString": "Proper command usage: **/evolve**\n\nThis command will check any Pokemon in your team and see if they are able to evolve. To see the criteria needed for evolution, check out the last page of the **/pokedex** entry for a specific Pokemon. After running the evolve command, you will be prompted with 2 select menus. The first menu will be all Pokemon in your team able to evolve. Once the first option is selected, the second menu will contain all available evolution options for the Pokemon to evolve into (i.e. If Oddish is chosen to evolve, the second list will contain Gloom). You may evolve any Pokemon that is a member of your party.",
      "RequiresAdmin": false
    },
    {
      "Name": "givecandy",
      "ShortString": "Give an experience candy to one of your Pokemon.",
      "HelpString": "Proper command usage: **/givecandy**\n\nCandies are a way to gain experience points and levels for the Pokemon in your team. Different candies provide different experience amounts:\n- Rare Candy: 1 Level\n- XS Candy: 100 XP\n- S Candy: 800 XP\n- M Candy: 3000 XP\n- L Candy: 10000 XP\n- XL Candy: 30000 XP\nYou can find candies through defeating **/spawn** Pokemon, and can view them in your **/inventory**.",
      "RequiresAdmin": false
    },
    {
      "Name": "learnmove",
      "ShortString": "Teach a Pokemon a move learned by level-up.",
      "HelpString": "Proper command usage: **/learnmove *pokemon***\nParameters:\n**pokemon** - Pokemon in your current team\n\nThis command allows you to re-teach a Pokemon in your team a move that they will have learned during leveling up. It will cost you **$500** to teach a move using this command.",
      "RequiresAdmin": false
    },
    {
      "Name": "nickname",
      "ShortString": "Give your Pokemon a nickname.",
      "HelpString": "Proper command usage: **/nickname *pokemon***\nParameters:\n**pokemon** - Which Pokemon you would like to nickname\n\nThis command gives you the opportunity to nickname one of your Pokemon. After providing which Pokemon you would like to nickname, it will give you a selection of all the versions of that Pokemon you own (up to 25), in which you would select one to nickname.\n\nOnce you select the specific Pokemon, you may nickname it whatever you like up to **20 characters**. If you provide a blank nickname, it will go back to using the default Pokemon name.",
      "RequiresAdmin": false
    },
    {
      "Name": "pokecenter",
      "ShortString": "Heal up your current team of Pokemon.",
      "HelpString": "Proper command usage: **/pokecenter**\n\nThis command is a way for trainers to heal their team of any HP loss or ailments. This is a free way to heal without using items, and will automatically be used if any battle is lost.",
      "RequiresAdmin": false
    },
    {
      "Name": "pokedex",
      "ShortString": "Displays the users Pokedex entries.",
      "HelpString": "Proper command usage: **/pokedex *[@user]* *[dex]* *[pokemon]***\nParameters:\n**@user** - (Optional) View another server members list.\n**dex** - (Optional) Which Dex to view progress for.\n**pokemon** - (Optional) Specific Pokemon to check Dex status for.\n\nThe **/pokedex** command will display the current (or given) users current Pokedex data in a text list format. Using the options above, you can change which Dex to view the information for, the different lists being:\n- **Pokedex**: Normal dex based on the default Pokedex ID\n- **Form Dex**: Special Pokedex that treats different forms separately (i.e. Meowth vs. Alolan Meowth)\n- **Shiny Dex**: Similar to the Form Dex, but for shiny Pokemon\n\nIf you specify a Pokemon, it will show you the regular and shiny form status for the selected dex (including male and female forms when applicable), as well as details about the Pokemon if you have it registered in your regular Pokedex. The last page will show the requirements for evolving the Pokemon when applicable.\n\n__Examples__\n**/pokedex** - Display the current (or given) users Pokedex in a list format, checkmarks indicating what is registered.\n**/pokedex dex:Form Dex** - Display the Form Dex in a list format, checkmarks indicating what is registered.\n**/pokedex dex:Pokedex pokemon:Diglett** - Displays three Diglett pages, one non-shiny with a checkmark and details, one shiny with a checkmark and details if you have captured that specific forms shiny, and it's evolution requirments to evolve into Dugtrio.",
      "RequiresAdmin": false
    },
    {
      "Name": "searchtypes",
      "ShortString": "Displays All Pokemon belonging to a type.",
      "HelpString": "Proper command usage: **/searchtypes *type***\nParameters:\n**type** - The type you wish to see Pokemon for.\n\nThis command will print out all Pokemon that belong to the type specified. The order will be as such:\n- Pure types sorted by name\n- Primary types sorted by name\n- Secondary types sorted by name.",
      "RequiresAdmin": false
    },
    {
      "Name": "spawn",
      "ShortString": "Spawn a Pokemon that you may capture or fight.",
      "HelpString": "Proper command usage: **/spawn**\n\nSpawning is how trainers can grow their collection through capturing, or earn money and experience through fighting. When the **/spawn** command is run, there are a few factors that go into the spawn calculation. The first factor to be considered is the spawn rarity, then there are some exclusions, and finally there are numbers crunched for shiny odds and other details.\n\n__Rarity__\nThis determines the odds of a Pokemon spawning in the wild. It is based off of how many evolutions in the chain (1, 2, or 3), and the total base stats of the final evolution. Normally, only the initial stage can spawn, but once the levels start to get higher, there will be a chance for later stages to appear. Also, beware of a hidden Ditto!\n\n__Exclusions__\nThere are exclusions that will not be found during a regular spawn. Here is a list of Pokemon types that do not spawn:\n- Mega forms\n- Ultra Beasts\n- Paradox\n- Fossils\n- Legendaries/Mythicals\n- Starters.\n\n__Details__\nSome details that are calculated during the spawn process are *shiny rate*, *height/weight*, and *female chance*\n- **Shiny Rate** - Base set at 1/3000\n- **Height/Weight** - +/- 10% of the average stat seen from **/pokedex**\n- **Gender** - Each Pokemon has a stat out of 8 to be female.\nIcons on a spawn will be as such:\n- 🟦/🟥: The gender of the current spawn\n- ✨: If the current spawn is a shiny\n\nMore information can be seen through **/help capture** and **/help fight**.",
      "RequiresAdmin": false
    },
    {
      "Name": "spawnlegendary",
      "ShortString": "Spawn a Legendary Pokemon that you may capture or fight.",
      "HelpString": "Proper command usage: **/spawnlegendary**\n\nSpawning a Legendary Pokemon is locked until you have defeated all Gym Leaders in a region. Once the gym challenge is complete, you are able to spawn a legendary. It will only spawn Legendary Pokemon belonging to the region you are currently in.\n\nYou are only able to capture a single Legendary until you become Champion of the region. You may fight as many as you wish, but only a single Legendary can be captured before the Elite Four. Once you are Champion, you can spawn and capture the rest of the Legendaries in the region.\n\nCaptured Legendaries will no longer spawn, so be careful trading them away!\n\nMore information can be seen through **/help capture** and **/help fight**.",
      "RequiresAdmin": false
    },
    {
      "Name": "usepotion",
      "ShortString": "Select a potion from your inventory to heal a Pokemon.",
      "HelpString": "Proper command usage: **/usepotion**\n\nThis command will bring up two selection boxes. The first will be a list of available potions you have in your inventory. The second will be the Pokemon in your team. If you select a Pokemon in which the potion will have no effect, it will notify you and not use the potion. Make sure to *Exit* when finished!",
      "RequiresAdmin": false
    },
    {
      "Name": "usetm",
      "ShortString": "Teach a Pokemon a move using a TM.",
      "HelpString": "Proper command usage: **/usetm *tm***\nParameters:\n**tm** - Technical Machine to use on a Pokemon\n\nThis command allows you to use a TM from your inventory to teach a move to your Pokemon in your team. This will consume the TM, but will not cost money to use, only to purchase.",
      "RequiresAdmin": false
    }
  ],
  "Actions": [
    {
      "Name": "breeding",
      "ShortString": "",
      "HelpString": "Having two Pokemon in your **/daycare** will give you the ability to breed and obtain Eggs! There are a few factors that go into breeding and it's calculations:\n- Pokemon must be different genders (or one Ditto)\n- Pokemon must belong to the same Egg group\n- It takes 12 Hours to breed an egg\n- You can only obtain 1 egg every 12 hours\nIf all conditions are met and an egg is made, it will have a few generated statistics:\n- It will be the initial stage of the mother Pokemon (or non-Ditto)\n- It will take three random IV stats from both parents\nThe odds of the Pokemon being a shiny are calculated when the egg is obtained, but will roll when hatching. The shiny odds are cut in *half* if you are breeding with two Pokemon with different Original Trainers.",
      "RequiresAdmin": false
    },
    {
      "Name": "capture",
      "ShortString": "",
      "HelpString": "With every Pokemon wild spawn, you have the ability to capture it using any Pokeball in your **/inventory**. The factors that go into a capture success are:\n- Wild Pokemon % HP left\n- Pokeball used for capture\n- Capture rate of the wild Pokemon\n- Level of the wild Pokemon\n- Status condition of the wild Pokemon\nIf a Pokemon is successfully captured, it will be added to your team as they were when captured, or healed and added to your box.",
      "RequiresAdmin": false
    },
    {
      "Name": "elitefourlock",
      "ShortString": "",
      "HelpString": "During your Elite Four challenge, you will be blocked from performing certain commands. You will only be allowed to look up information, such as **/pokedex**, and use items in your bag, such as **/usepotion**. The lock will be removed once you have completed the challenge, or have been defeated.\n\nIf you experience any issues, please report them to the [Discord Server](https://discord.com/invite/W9T4K7fyYu).",
      "RequiresAdmin": false
    },
    {
      "Name": "fight",
      "ShortString": "",
      "HelpString": "There are two types of battles that a trainer can partake in: wild encounters and gym/elite four battles.\n\nDuring a battle, you can choose to Attack, Swap Pokemon, Use an Item, or Flee (wild only).\n\n__Attacks__\nNot every move has been implemented for the battle scenarios. Moves like *Protect* or any *Dynamax* moves may come at a later date. There also may not be every single effect that you may expect from a move, but feedback is always welcome in the PokeTrainer [Discord Server](https://discord.com/invite/W9T4K7fyYu)!\n\nCurrent Implementation:\n- Basic attacks, physical and special (Tackle, Bubblebeam, ...)\n- Status moves (Leer, Nasty Plot, ...)\n- Counter Attacks (Counter, Mirror Coat, ...)\n- Multi-Turn Attacks (Fly, Dive, ...)\n- Repetition Attacks (Rollout, Ice Ball, ...)\n\n__Swap__\nYou are able to take your turn to swap out your current Pokemon with another on your team. The target Pokemon must have HP > 0.\n\n__Use Item__\nYou are able to take your turn to use items as well. For wil encounters only, you can attempt to capture the Pokemon using a Pokeball. You may also heal a member of your party using a Potion.\n\n__Flee__\nThis is only available during wild encounters. It will calculate your flee success by comparing the speed of the Pokemon in battle. After three attempts, you will automatically flee.\n\nIf you lose any battle, you will automatically go to the **/pokecenter**.",
      "RequiresAdmin": false
    },
    {
      "Name": "lock",
      "ShortString": "",
      "HelpString": "Due to how the data of PokeTrainer is kept and updated, there were ways to circumvent certain actions and 'rewind' time to a previous state. Locks for commands have been put in place so that if you are using a command that has the potential to edit your data, it will prevent you from using another command of the same nature.\n\nDue to this now being in place **DO NOT DISMISS MESSAGES** instead of using the interaction buttons. If you do, there is a possibility that you will be locked from using certain commands for up to **5 minutes**.\n\nIf you experience any issues, please report them to the [Discord Server](https://discord.com/invite/W9T4K7fyYu).",
      "RequiresAdmin": false
    },
    {
      "Name": "missions",
      "ShortString": "",
      "HelpString": "Trainers will have access to both Daily and Weekly missions to give out rewards upon completion. To receive either mission, use the **/daily** command, and to view them and their current status use the **/trainer** command. Details for each seen below.\n\n__Daily Missions__\nThese missions are given out during every **/daily** reset (00:00 UTC). The following list are possibilities of what a daily mission can be:\n- Catch a number of Pokemon (may be type specific)\n- Battle a number of Pokemon (may be type specific)\n- Evolve a Pokemon\n- Release a number of Pokemon\n- Trade a Pokemon\n- Attempt a **/gymbattle**\nThe reward for completing a daily mission is **3x Rare Candy**.\n\n__Weekly Missions__\nThese missions are refreshed every Monday (00:00 UTC) by using the **daily** command. The following are a list of possible missions:\n- Catch a number of Pokemon\n- Battle a number of Pokemon\n- Evolve a number of Pokemon\n- Release a number of Pokemon\n- Trade a number of Pokemon\nThe reward for completing a weekly mission is **1x Masterball**.",
      "RequiresAdmin": false
    },
    {
      "Name": "regionreward",
      "ShortString": "",
      "HelpString": "Completing a regions Gym and Elite Four Challenge will provide you with extra rewards to help along in your journey. There is also a wild Pokemon progression as you go.\n\n__Wild Encounters__\nFor every Badge that you obtain in a region, the level ranges of your wild encounters will increase by 5.\nEx. In the Kanto Region, wild Pokemon will start with a range of Lvl. 2-9. After 6 gym badges are obtained, they will now be spawning at Lvl. 32-39.\nThis scaling applies to every official region.\n\n__Region Rewards__\n- Kanto: The cost to learn a new move without a TM is cut in half\n- Johto: You now have a chance to critical catch any wild Pokemon with any ball\n- Hoenn: Your entire team gains XP when you capture a Pokemon\n- Sinnoh: Higher chance to receive a candy after defeating or capturing a wild Pokemon\n- Unova: Upgrade **/daily** to 10 Great Balls and $200\n- Kalos: Increase **/myeggs** slots to 8\n- Alola: Gain double the XP for defeating and capturing wild Pokemon\n- Galar: Daycare takes half the time to generate eggs.\n- Paldea: \n- Voltage: Increase your shiny odds on **/spawn** and **/daycare** eggs",
      "RequiresAdmin": false
    },
    {
      "Name": "update",
      "ShortString": "",
      "HelpString": "__10/13/2024__\n- Entire application rework\n\n__10/14/2024__\n- You can now choose a starter from any region at any time. You may still only acquire ONE per region\n- Fixed an issue where **/pokecenter** was charging $500 per use\n- Fixed an issue with **/spawnlegendary**\n- Fixed an issue where pseudos could be caught prior to gym six\n\n__10/14/2024__\n- Fixed an issue where mission progress was not being added\n- Fixed messaging for Elite Four battles\n- Fixed an issue with changin over to the Voltage Region\n- Fixed an issue with Healing moves such as Recovery\n- Fixed an issue where ailments like Paralyze were being cured when passing the movement check\n\n__10/16/2024__\n- Level cap for Gym Leaders changed for a little more lenience and growth per gym\n- Fixed an issue with adding Pokemon to the daycare\n- Fixed an issue with decimal values when using Healing Moves\n- Fixed trainers receiving $500 and 5 Pokeballs when changing regions\n\n__10/19/2024__\n- Changed the database in the back end to be more reliable, hopefully fixing an intermittent data issue\n- Fixed and issue with recharging attacks\n- Fixed an issue with move with consecutive attacks not lasting as long as they should\n\n__10/20/2024__\n- Added more links for upvoting with a new discord invite link!\n- Fixed consecutive attacks like Rollout using PP every turn instead of on first attack only\n- Fixed an issue where defeating a Gym Leader the first time would display the wrong message\n- You can now use Abra/Ditto/Smeargle in your team. However, they will only know the move Struggle since their movesets are not implemented yet\n- Fixed an issue with recoil fainting displaying a swap message twice\n\n__10/24/2024__\n- Updated spawn rates for **/spawnlegendary**\n- Updated Deoxys **/pokedex** evolve page wording\n- Added moves to some Pokemon learn sets\n- Added base Zacian and Zamazenta with evolutions into the Sword and Crown\n- Added combination evolution for Calyrex and Spectrier/Glastrier\n- Modified messages for **/buy** and **/sell**\n\n__11/14/2024__\n- Updated some documentation\n- Fixed an issue with data reversion for some wild battles\n\n__11/15/2024__\n- Fixed an issue with trainers being able to spawn with no conscious Pokemon on their team\n- Fixed an issue where trainers could not add a Pokemon to the **/daycare** when choosing between multiple of the same species\n\n__12/19/2024__\n- You can now search in **/starter** by generation\n- Egg progress is now added through **/spawnlegendary**\n- Added Ethers and Elixirs\n\n__12/20/2024__\n- Added Revives and Max Revives",
      "RequiresAdmin": false
    }
  ]
}