{
  "Server": [
    {
      "Name": "register",
      "ShortString": "(Admin Only) Registers this server with the PokeTrainer bot.",
      "HelpString": "Proper command usage: **/register**\n\nWhen this command is run, the current channel will be marked as an event channel. This means any public events or notifications from PokeTrainer will be sent to this channel. If you wish to change which channel events take place, look into the **/swapchannel** command.",
      "RequiresAdmin": true
    },
    {
      "Name": "server",
      "ShortString": "(Admin Only) Prints the current server settings.",
      "HelpString": "Proper command usage: **/server**\n\nThis command will return the details of the server settings for the bot. This includes the server name, registered event channel, and the current event taking place (if applicable).",
      "RequiresAdmin": true
    },
    {
      "Name": "unregister",
      "ShortString": "(Admin Only) Unregister this server from the PokeTrainer bot events.",
      "HelpString": "Proper command usage: **/unregister**\n\nThis command will remove your server from being able to receive public events and notifications. If you wish to receive public events again, look into the **/register** command.\n\nTrainers will still be able to interact with PokeTrainer as long as it is in the server, regardless of registration.",
      "RequiresAdmin": true
    },
    {
      "Name": "swapchannel",
      "ShortString": "(Admin Only) Change the current event channel of the server.",
      "HelpString": "Proper command usage: **/swapchannel**\n\nThis command will change the channel in which events and public notifications gets sent, to the current channel. You can see the current event channel by using the **/server** command.\n\nYour server must be registered with the bot by using the **/register** command in order to swap event channels and have events occur in your server.\nIf you wish to turn the events off, please use the **/unregister** command.",
      "RequiresAdmin": true
    }
  ],
  "Trainer": [
    {
      "Name": "starter",
      "ShortString": "Begin your PokeTrainer journey.",
      "HelpString": "Proper command usage: **/starter**\n\nThis command will start the trainers journey, giving them the starter Pokemon of their choosing as well as $500 and 5 Pokeballs. Trainers will begin with 50 Health, but no Potions. Use **/trainer** to view your stats and inventory as well as **/shop** to buy a variety Pokeballs and Potions!",
      "RequiresAdmin": false
    },
    {
      "Name": "badges",
      "ShortString": "Displays a list of your obtained badges.",
      "HelpString": "Proper command usage: **/badges *[region]* *[images]* *[@user]***\nParameters:\n**region** - (Optional) The region in which to filter your badge list.\n**images** - (Optional) Display badge images instead of a list.\n**@user** - (Optional) View another server members badge progress.\n\nThis command is used to display the current badge progress of either the specified user, or the user issuing the command. This will only display a list of obtained badges, which can be filtered by region (Kanto, Johto, etc.) and displayed in an image or text-based format. By default, the list displays in a text-based order of gyms by region (i.e. Boulder, Cascade, Thunder, etc.). To obtain more badges, use the **/gymbattle** command to fight gym leaders.",
      "RequiresAdmin": false
    },
    {
      "Name": "changezone",
      "ShortString": "Change the type of Pokemon you see during a spawn.",
      "HelpString": "Proper command usage: **/changezone *[zone]***\nParameters:\n**zone** - The zone in which to explore for wild Pokemon.\n\nThis command is used to change a trainers search zone when **/spawn**ing wild Pokemon. There are 18 different zones, all specifying two separate types. While you have a zone active, only Pokemon with these typings can spawn\n\nEx. If you choose **Volcano (Dragon/Fire)**, then only stage 1 and non-evolution Pokemon with the Dragon __or__ Fire type will spawn until changed or reset.\n\nTo change/reset your zone, simply run the **/changezone** command again and make the choice you wish to use.",
      "RequiresAdmin": false
    },
    {
      "Name": "daily",
      "ShortString": "Claim a small reward every day.",
      "HelpString": "Proper command usage: **/daily**\n\nThis command gives the user 10 Pokeballs and $200 every day, resetting at mignight UTC. If you have space in your inventory, it will also give you an egg to **/hatch** (more information through **/help eggs**). It will also give a link to upvote the bot on top.gg!",
      "RequiresAdmin": false
    },
    {
      "Name": "modifyteam",
      "ShortString": "Add or replace a member of your battle team.",
      "HelpString": "Proper command usage: **/modifyteam *[pokemon]***\nParameters:\n**pokemon** - (Optional) Name of Pokemon to add to the team.\n\nThis command has two operations and will bring up two dropdowns.\n\nThe first operation happens when you do not provide a name with the command. This is treated as modifying just your existing team members. One example is you wish to change which Pokemon is in your first team slot for battles. In this case, the first selection dropdown will consist of only your team members. It will contain their expanded name (gender and shiny included) as well as all other relevant stats. The second selection will be your current team alignment. This will tell you what Pokemon is currently in which slot. You may choose a slot to replace with the first selected team member, or there will be an option to remove the selected member entirely.\nNOTE: You must always have at least one Pokemon in your battle team.\n\nThe second operation is providing the name filter when issuing the command. This is used to add a Pokemon from your box to the team either by addition or replacement. With this command path, there will still be two selection dropdowns. However, this time the first selection will only be Pokemon not currently in the team with the name given through the filter. The selection choices will contain information about the Pokemon such as their expanded name (gender and shiny included) as well as all other relevant stats. The second selection will contain allcurrent team members with their details as well. If the current team is not full (6 members), there will be an additional selection named 'Add To End Slot', which will do exactly as it says. You may choose a current team member and replace them in that slot, or add the selected Pokemon to the last available slot on your team (if applicable).",
      "RequiresAdmin": false
    },
    {
      "Name": "myeggs",
      "ShortString": "View your current egg list in list or image format.",
      "HelpString": "Proper command usage: **/myeggs *[images]***\nParameters:\n**images** - (Optional) Display egg images instead of a list.\n\nThis command will display the eggs currently in your inventory, sorted by the order in which you obtained them. Information displayed on each page can contain their name, current progress, and what rarity they will hatch into. A ✅checkmark will be placed next to any eggs that are ready to **/hatch**.\n\nYou may also see the short-hand list through **/trainer**. For more information on eggs use **/help eggs**",
      "RequiresAdmin": false
    },
    {
      "Name": "myteam",
      "ShortString": "View your current battle team in detailed image format.",
      "HelpString": "Proper command usage: **/myteam**\n\nThis command will display your current battle team in the order of slot placement. Information displayed on each page will contain their expanded name (gender, shiny, and level included), current exp., height/weight, typing, and if they can currently evolve. To change your team, use the **/modifyteam** command.",
      "RequiresAdmin": false
    },
    {
      "Name": "mypokemon",
      "ShortString": "Displays the current or given users owned Pokemon.",
      "HelpString": "Proper command usage: **/mypokemon *[image]* *[order]* *[shiny]* *[@user]***\nParameters:\n**image** - (Optional) Whether the list should be shown in image format.\n**order** - (Optional) How the list should be ordered.\n**shiny** - (Optional) Choose if shiny Pokemon are specially sorted.\n**@user** - (Optional) View another server members list.\n\nThis command will display the current (or given) users current Pokemon collection in a text list form by default. Using the options above, you can format and change the returned list to your liking.\nNOTE: This is *not* a list of the actual Pokedex progress, but a list of currently owned Pokemon.\n\n__Examples__\n**/mypokemon images:Yes** - Display the current (or given) users Pokemon in a carousel image format with default ordering and no special shiny sorting.\n**/mypokemon order:Name shiny:Shiny First** - Display Pokemon in a text list and sort the list by name. Shiny Pokemon will be displayed and sorted by name at the front of the list.\n```Gloom✨\nVulpix✨\nAbra\nBlaziken\nZubat```\n**/mypokemon  order:National Dex shiny:Shiny Only** - Displays the list in sorted order by National Dex number and only displays owned shinies.",
      "RequiresAdmin": false
    },
    {
      "Name": "release",
      "ShortString": "Release one or many of the selected Pokemon.",
      "HelpString": "Proper command usage: **/release *pokemon***\nParameters:\n**pokemon** - Name of the Pokemon species you own that you wish to release.\n\nThis command will bring up a single dropdown listing all variations of the selected Pokemon outside of your set team. The selection list will contain a maximum of 25 Pokemon, so if you own 30 Pidgeys it will display the first 25 in your box. You will see the level, hieght, weight, and types for each Pokemon listed. You may select one, a few, or all Pokemon listed.\n\n**NOTE:** You cannot release a Pokemon currently in your team. You must change it out using **/modifyteam** first.",
      "RequiresAdmin": false
    },
    {
      "Name": "trainer",
      "ShortString": "Displays stats about the current or given user.",
      "HelpString": "Proper command usage: **/trainer *[@user]***\nParameters:\n**@user** - (Optional) View another server members statistics.\n\nThis command will give statistics regarding the trainer belonging to either yourself or the specified user. Information will include stats such as health, Pokedex completion, current number of Pokemon owned, current number of shiny Pokemon, and badge completion.\nThere is also an *Inventory* section that will display all relevant items such as Pokeballs, Potions, and Candies, and an Egg section that will show all current eggs and their progress.",
      "RequiresAdmin": false
    },
    {
      "Name": "usepotion",
      "ShortString": "Select a potion from your inventory to heal your trainer.",
      "HelpString": "Proper command usage: **/usepotion *potion***\nParameters:\n**potion** - Which type of potion to heal yourself with.\n\nThis command is how you can heal your trainer health using the Potions within your inventory. If your trainer is at full health, it will notify you and not use your potion. To see your current Potions, use the **/trainer** command. To buy more potions, use the **/shop** command.\n\n__Healing__\n**Potion** - 10 HP\n**Super Potion** - 40 HP\n**Hyper Potion** - 80 HP\n**Max Potion** - 100 HP",
      "RequiresAdmin": false
    }
  ],
  "Gym": [
    {
      "Name": "gymbattle",
      "ShortString": "Fight the next gym leader on your journey.",
      "HelpString": "Proper command usage: **/gymbattle**\n\nThis command will automatically determine the next gym leader for your journey. The fight will consist of the current trainers battle team, which can be modified through **/modifyteam**, and the gym leaders battle team. You may see information about any gym leader by using the **/gyminfo** command. In order for the challenge to be accepted, you must have enough money that if you lose, you are able to pay. This amount is equal to half the reward of the gym leader.\n\nWhen challenge is accepted for a gym to battle, there is a chance for experience, money, and a gym badge. Fighting results are based off of 3 different comparisons in the process:\n- Typing Matchup\n- Rarity\n- Pokemon level (not all cases)\n\nThe gym battle will start from the first slot of each team, eliminating one Pokemon per round until a team is wiped out. Example of a battle seen below. More details on how the fights work can be seen by using the **/help fight** command.\n\nWhen fighting gym leaders, the trainer does not lose HP, unlike fighting wild Pokemon. During the fights, Pokemon will gain experience for each gym member they defeat. Only the Pokemon that defeats the opponent will get experience. The amount of experience is based on the opponents level multiplied by **5x**. Exp Share does NOT contribute during gym fights.\n\n__Example Fight:__\n```ansi\n| \u001b[0;31mGardevoir\u001b[0m | \u001b[0;37mStaryu\u001b[0m  |\n|   \u001b[0;31mAxew\u001b[0m    | \u001b[0;37mStaryu\u001b[0m  |\n|  \u001b[0;37mLeafeon\u001b[0m  | \u001b[0;31mStaryu\u001b[0m  |  \n|  \u001b[0;31mLeafeon\u001b[0m  | \u001b[0;37mStarmie\u001b[0m |\n|  \u001b[0;31mNuzleaf\u001b[0m  | \u001b[0;37mStarmie\u001b[0m |```\n\nNOTE: You can simulate a battle between two Pokemon using **/battlesim** for more details.",
      "RequiresAdmin": false
    },
    {
      "Name": "gyminfo",
      "ShortString": "Display information about a specified gym leader.",
      "HelpString": "Proper command usage: **/gyminfo *leader***\nParameters:\n**leader** - Which gym leader to display.\n\nThis command provides the trainer information about a former or upcoming gym leader. During the command entry, a list of gym leaders will be provided and the next leader on the trainers journey will be labeled. The default information given is a image of the gym leader, the name of their badge, the type of gym they are, and the reward for defeating them. If you have already defeated the gym leader, there will be another page available that displays their battle team.\n\nNOTE: You may also filter by region when running the command.",
      "RequiresAdmin": false
    }
  ],
  "Trade": [
    {
      "Name": "trade",
      "ShortString": "Trade Pokemon between two users.",
      "HelpString": "Proper command usage: **/trade *user* *give* *receive***\nParameters:\n**user** - Target user to trade with.\n**give** - Pokemon you wish to trade away.\n**receive** - Pokemon you wish to receive.\n\nThe **/trade** command is a simple interaction that allows trainers to trade a single Pokemon between each other. You will input the user to trade with, the name of what you wish to give up, and the name of what you wish to receive.\n\nTwo selection boxes will show up, one for the specific Pokemon to give away, and one for the specific Pokemon to receive in the trade.\n__NOTE__: Pokemon currently in a team can NOT be traded.\n\nOnce the trade is submitted, a ping message will be sent asking the target user if they accept the trade, showing details of each Pokemon selected (level, height, weight, color, typing). If the target user accepts, the Pokemon are traded and the Pokedex of each user is updated.",
      "RequiresAdmin": false
    }
  ],
  "Shop": [
    {
      "Name": "shop",
      "ShortString": "Buy or sell items.",
      "HelpString": "Proper command usage: **/shop**\n\nProvides the trainer with the ability to buy items from the shop, or sell items from their inventory.\n\nTo purchase an item, select the 'Buy' option. When purchasing items, the only possible choices are what is affordable, your current funds displayed above the cancel and submit buttons (i.e. If the trainer has $300, they will NOT see Ultraball, Hyper Potion, or Max Potion). The selections will have the prices labeled next to their names. After selecting the item, they may choose how many they wish to buy. Again, it will only allow you to buy what you can afford.\n\nTo sell items, select the 'Sell' option on the dirst dropdown. The second dropdown will populate with the current items in your inventory and their sale price. Once an item is selected, it will ask how many you wish to sell.\n\nAfter either operation, you will receive a confirmation of the sale and your new current funds.",
      "RequiresAdmin": false
    }
  ],
  "Pokemon": [
    {
      "Name": "battlesim",
      "ShortString": "Simulate a wild/gym battle between two Pokemon.",
      "HelpString": "Proper command usage: **/battlesim *battle* *attacker* *defender***\nParameters:\n**battle** - Specify wild or gym battle.\n**attacker** - Pokemon on the offensive.\n**battle** - Defending Pokemon.\n\nBattleSim will help trainers understand the intricacies of Pokemon battles within PokeTrainer. There are three sections which will help understand a specific matchup between the Pokemon selected:\n- Type Matchup\n- Rarity Matchup\n- Level Assistance\nEach section will provide details as to what calculations would happen and a possible outcome for the given battle.",
      "RequiresAdmin": false
    },
    {
      "Name": "daycare",
      "ShortString": "Up to two Pokemon will gain passive experience over time.",
      "HelpString": "Proper command usage: **/daycare *[pokemon]***\nParameters:\n**pokemon** - (Optional) Name filter of the Pokemon you wish to add to the daycare.\n\nDaycare is another way for your Pokemon to gain experience. This is a passive gain that is purely time-based, gaining 10xp every hour they are in the Daycare.\n\nYou may only have up to two Pokemon stored in the Daycare at a time. You may add a Pokemon to the Daycare by specifying what Pokemon to add while running the command. To check on and remove Pokemon from the Daycare, run the command without any specifications.\n\n__NOTE__: There are currently no Eggs obtainable from the Daycare.",
      "RequiresAdmin": false
    },
    {
      "Name": "evolve",
      "ShortString": "Evolve one of your Pokemon that are eligible.",
      "HelpString": "Proper command usage: **/evolve *[pokemon]***\nParameters:\n**pokemon** - (Optional) Name filter of the Pokemon you wish to evolve.\n\nWhen you own a Pokemon that meets the criteria for evolution, this command is used to actually do the evolution step. To see the criteria needed, check out **/help evolution** which will contain much more detail. After running the evolve command, you will be prompted with 2 select menus. The first menu will be all available options for evolution (filtered if the parameter is given), up to 25 different selections. Once the first option is selected, the second menu will contain all available evolution options for the initial Pokemon to evolve into (i.e. If Gloom is chosen to evolve, the second list will contain Vileplume and Bellossom). You may evolve any Pokemon that you own, including any members of your party.",
      "RequiresAdmin": false
    },
    {
      "Name": "givecandy",
      "ShortString": "Give an experience candy to one of your Pokemon.",
      "HelpString": "Proper command usage: **/givecandy *[pokemon]***\nParameters:\n**pokemon** - (Optional) Name filter of the Pokemon you wish to receive a candy.\n\nCandies are a way to gain experience points and levels for your Pokemon. Currently there are only three different candies:\n- Small Candy: 15 experience\n- Large Candy: 40 experience\n- Rare Candy: 1 Level\nYou can purchase candies through the **/shop** and view how many you currently own through **/trainer**.",
      "RequiresAdmin": false
    },
    {
      "Name": "hatch",
      "ShortString": "Hatch your eggs that are ready.",
      "HelpString": "Proper command usage: **/hatch**\n\nOnce your eggs reach the required **/spawn** count (see **/help eggs** for more information), this command will actually hatch them and provide your new Pokemon. This will provide you with a select list of all hatchable eggs that you can do at the same time. Hatching an egg also gives you **$50** towards your trainer. Eggs also have a re-roll for a ✨shiny✨!\n\nCurrent egg progress can be seen through **/myeggs** or **/trainer**. Remember, you cannot throw eggs away, so make sure you hatch them!",
      "RequiresAdmin": false
    },
    {
      "Name": "pokedex",
      "ShortString": "Displays the current or given users owned Pokemon.",
      "HelpString": "Proper command usage: **/pokedex *[@user]* *[dex]* *[pokemon]***\nParameters:\n**@user** - (Optional) View another server members list.\n**dex** - (Optional) Which Dex to view progress for\n**pokemon** - (Optional) Specific Pokemon to check Dex status for.\n\nThe **/pokedex** command will display the current (or given) users current Pokedex data in a text list format. Using the options above, you can change which Dex to view the information for, the different lists being:\n- **Pokedex**: Normal dex based on the default Pokedex ID\n- **Form Dex**: Special Pokedex that treats different forms separate (i.e. Meowth vs. Alolan Meowth\n- **Shiny Dex**: Similar to the Form Dex, but for shiny Pokemon\n\nIf you specify a Pokemon, it will show you the regular and shiny form status for the selected dex, as well as details about the Pokemon if you have it registered in your regular Pokedex. If you select Shiny Dex and specify a Pokemon, the Checkmark will default to Form Dex.\n\n__Examples__\n**/pokedex** - Display the current (or given) users Pokedex in a list format, checkmarks indicating what is registered.\n**/pokedex dex:Form Dex** - Display the Form Dex in a list format, checkmarks indicating what is registered.\n**/pokedex dex:Pokedex pokemon:Diglett** - Displays two Diglett pages, one non-shiny with a checkmark and details if you have captured Diglett or Alolan Diglett, and one shiny with a checkmark if you have captured that specific forms shiny.",
      "RequiresAdmin": false
    },
    {
      "Name": "pokeinfo",
      "ShortString": "Displays Pokemon information for the specified search.",
      "HelpString": "Proper command usage: **/pokeinfo *search* *filter***\nParameters:\n**search** - Which kind of search to perform.\n**filter** - The filter based on the search provided.\n\nThis command is a way for trainers to look at what Pokemon species belong to different groups. There are 2 different options to search for:\n\n__Pokemon By Color__\nThe filter for this search will be all color classifications that a Pokemon can have (such as *blue*, *red*, etc.). The color of a Pokemon is based on the Color filter within **Pokemon HOME**. The result of this search will be a text-based list of Pokemon names that belong in the selected color group, sorted by name.\n\nYou may see some oddities, such as Alolan Rattata being grouped with *purple*. This is because **Pokemon Home** classifies each Pokemon based on the *species*, and both Rattata and Alolan Rattata are of the same *Rattata* species, which base color is purple.\n\n__Pokemon By Type__\nThe filter will consist of all the different types a Pokemon can be. Once the type is selected, a list of text-based Pokemon names belonging to the type will be shown. They will also have their types listed, and will be sorted by solo typing, selected type being the main type, then selected typing being the secondary type:\nExample: **/pokeinfo type:Dragon**```Axew (Dragon)\nBagon (Dragon)\n...\nAltaria (Dragon/Flying)\nArctibax (Dragon/Ice)\n...\nAlolan Exeggutor (Grass/Dragon)\nKingdra (Water/Dragon)\n...```",
      "RequiresAdmin": false
    },
    {
      "Name": "spawn",
      "ShortString": "Spawn a Pokemon that you may capture or fight.",
      "HelpString": "Spawning is how trainers can grow their collection through capturing or earn money and experience through fighting. When the **/spawn** command is run, there are a few factors that go into the spawn calculation. The first factor to be considered is the spawn rarity, then there are some exclusions (including your zone types from **/changezone**), and finally there are numbers crunched for shiny odds and other details.\n\n__Rarity__\nMore information can be seen through the **/help rarity** command. Only certain rarities can spawn through the basic command: 1, 2, and 3 (no evolution). This means only first stage Pokemon can spawn through the command.\nEx. Oddish, Smeargle, and Sentret can spawn, but not Weepinbell or Arcanine\n\n__Exclusions__\nThere are exclusions that will not be found during a regular spawn. Here is a list of Pokemon types that do not spawn:\n- Mega forms\n- Ultra Beasts\n- Paradox\n- Fossils\n- Legendaries/Mythicals\n- Starters.\n\n__Details__\nSome details that are calculated during the spawn process are *shiny rate*, *height/weight*, and *female chance*\n- **Shiny Rate** - Currently set at 1/3000\n- **Height/Weight** - +/- 10% of the average stat seen from **/pokeinfo**\n- **Gender** - Each Pokemon has a stat out of 8 to be female.\nIcons on a spawn will be as such:\n- ✅: You have this Pokedex entry already registered\n- ☑️: You have this specific form already registered\n- 🟦/🟥: The gender of the current spawn\n- ✨: If the current spawn is a shiny\n\nEvery spawn will have 5 buttons attached: Pokeball, Greatball, Ultraball, Fight, and Run. The Pokeballs are used for capturing, while the fight button is used for....fighting! An explanation for each can be seen through **/help capture** and **/help fight**.",
      "RequiresAdmin": false
    }
  ],
  "Actions": [
    {
      "Name": "capture",
      "ShortString": "",
      "HelpString": "With every Pokemon wild spawn, there are three different buttons to try and capture. The three correspond to:\n🔴 - Pokeball, 🔵 - Greatball, 🟡 - Ultraball\n\nFor a capture to be successful, the trainer must choose one of the ball buttons and have at least one of the chosen ball in their inventory, able to be checked with the **/trainer** command.\n\nThe success of a capture is based on a few things:\n- Capture rate of the Pokemon (**/pokeinfo**)\n- Ball used to capture\n- Level (only levels 13 and below)\n- Pokemon are treated as half HP\nThe math behind this is a bit much to explain in help docs, but it is vaguely based off of the real capture success rates. You will find similar numbers crunching through the real equations with the same data.\n\nOn a successful capture, you will gain the Pokemon as well as $25",
      "RequiresAdmin": false
    },
    {
      "Name": "eggs",
      "ShortString": "",
      "HelpString": "Every time you use the **/daily** command, you will receive an egg. There are three different levels of eggs you can obtain: Level One, Level Two, Special.\n\n__Level One Egg__\n- These eggs have a 75% chance of being obtained from a **/daily** roll.\n- These take 100 **/spawn** interactions to become ready to hatch.\n- They will hatch into any First Stage Pokemon in an evolution chain, including fossils and starters but NOT including legendaries.\n\n__Level Two Egg__\n- These eggs have a 24% chance of being obtained from a **/daily** roll.\n- These take 150 **/spawn** interactions to become ready to hatch.\n- They will hatch into any Pokemon without an evolution line, NOT including legendaries.\n\n__Special Egg__\n- These eggs have a 1% chance of being obtained from a **/daily** roll.\n- These take 200 **/spawn** interactions to become ready to hatch.\n- They will hatch into any First Stage Legendary Pokemon in an evolution chain.\n\n\nYou can only have 5 total eggs in your inventory, and cannot get rid of them. When they reach their interaction amount, use the **/hatch** command to get your new Pokemon at level 1.\n\nEggs also have a re-roll for a ✨shiny✨!",
      "RequiresAdmin": false
    },
    {
      "Name": "evolution",
      "ShortString": "",
      "HelpString": "Evolution in PokeTrainer is much more simplified than the mainstream games. If a Pokemon has an option for evolution, it will always use a level requirement to evolve, standardized among all Pokemon of the same rarity. Rarity explanations can be viewed with **/help rarity**. A brief summary of level requirements are as such:\nStage 1 > Stage 2: **Level 20**\n- Ex. Caterpie > Metapod\n\nStage 1 > Final Stage: **Level 30**\n- Ex. Ponyta > Rapidash\n\nStage 2 > Final Stage: **Level 35**\n- Ex. Dragonair > Dragonite\n\nGaining experience comes from battling wild Pokemon and gym battles, a better descriptions seen through **/help fight**. The amount of experience required for a level is based off of the Pokemons current level and evolution stage count.\n\n__3-Stage Evolution__\nStage 1 - Lvls 1-19: 50xp, 20-35: 150xp, 35+: 250xp\nStage 2 - Lvls 1-35: 150xp, 35+: 250xp\nStage 3 - All Levels: 250xp\n\n__2-Stage Evolution__\nStage 1 - Lvls 1-30: 100xp, 30+: 250xp\nStage 2 - All Levels: 250xp\n\n__No Evolution/Legendaries__\nAll Levels: 200xp",
      "RequiresAdmin": false
    },
    {
      "Name": "regionreward",
      "ShortString": "",
      "HelpString": "Completing a regions gym gauntlet will provide you with extra rewards to help along in your journey. There is also a wild Pokemon progression as you go.\n\n__Wild Encounters__\nFor every *2 Gym Badges* that you obtain, the level ranges of your wild encounters will increase.\nEx. At the beginning, first stage wild Pokemon have a range of Lvl.3-7. After 10 gym badges are obtained, they will now be spawning at Lvl.8-12.\nThis scaling goes all the way through the last official region.\n\n__Region Rewards__\n- Kanto: Exp. Share for your second team slot on wild encounters\n- Johto: Higher chance for better eggs on a **/daily** call\n- Hoenn: 10% chance to automatically win a wild fight and lose 0hp\n- Sinnoh: 10% chance to critical success catch any wild Pokemon with any ball\n- Unova: Upgrade **/daily** to 20 Pokeballs and $500\nOther region rewards coming soon!",
      "RequiresAdmin": false
    },
    {
      "Name": "rarity",
      "ShortString": "",
      "HelpString": "Rarity is best described as how rare a Pokemon is to be chosen during a **/spawn** command. There are 5 different levels of rarity (not including legendaries):\n```Level 1 - Stage 1 of a 3-stage evolution.\n- Examples: Pidgey, Nidoran.\nLevel 2 - Stage 1 of a 2-stage evolution.\n- Examples: Onix, Eevee.\nLevel 3 - Stage 2 of a 3-stage evolution OR a Pokemon without an evolution.\n- Examples: Lapras, Haunter.\nLevel 4 - Final stage of a 2-stage evolution.\n- Examples: Gyarados, Weezing.\nLevel 5 - Final stage of a 3-stage evolution.\n- Examples: Victreebel, Dragonite.```\nRarity is calculated based on if there are evolutions preceeding or succeeding the current Pokemon, and how many. Two normal examples are the Pidgey/Fearow lines:\n```Pidgey (1) ---> Pidgeotto (3) ---> Pidgeot (5)\n\nSpearow (2) ---> Fearow (4)```\nOne strange example is the Mime Jr. line:\n```             ---> Mr. Mime (4)\nMime Jr. (1) |\n             ---> Galarian Mr. Mime (3) ---> Mr. Rime (5)```\nMime Jr. is considered a rarity 1 because it's the initial stage and its maximum chain is 3 evolutions. Mr. Mime is considered rarity 4 because it's considered the final evolution in a 2-stage chain.\n\nDuring battles, Pokemon are placed into something called __rarity groups__. These are based on the initial rarity of the Pokemon:\n```Rarity Group 1: Stage 1 Pokemon (Rarity 1/2)\n- Examples: Pidgey, Spearow\n\nRarity Group 2: Middle or No Evolution Pokemon (Rarity 3)\n- Examples: Pidgeotto, Lapras\n\nRarity Group 3: Final Stage Pokemon (Rarity 4/5)\n- Examples: Pidgeot, Fearow\n\nLegendaries have their own grouping based on their high rarities (8/9/10)```",
      "RequiresAdmin": false
    },
    {
      "Name": "fight",
      "ShortString": "",
      "HelpString": "There are two types of fights that a trainer can partake in: wild fights and gym battles.\n\n**__Wild Fight__**\nWhen a Pokemon spawns, there is a reaction available to fight it (⚔️). This will provide money ($50) and experience to the Pokemon you choose to fight. You must have some amount of HP to expend for a fight to occur, the command will warn you if your HP is low.\n\nFighting results are based off of 3 different comparisons: typing matchup, level, and rarity. When a trainer fights a wild Pokemon, they are always on the offensive. This means every typing check is based off of the trainer's Pokemon being the attacker and the wild Pokemon being the defender.\n\nLosing 10hp or more will consider the battle lost and will reward no experience or money.\n\nNOTE: Pokemon levels can reduce/increase the amount of health lost depending on the scale.\n\n**__Gym Battle__**\nWhen you trigger a gym battle by using **/gymbattle**, the fight is slightly different compared to a wild fight. It does not cost HP to fight a gym leader, but money instead. More can be seen through **/help gymbattle**.\n\nThe fight results are based off of similar comparisons: typing matchup and rarity, with level being a last resort factor in most cases. Gym Leader Levels are as such:\n- First Stage: **Level 15**\n- Second Stage/No Evolution: **Level 25**\n- Final Stage: **Level 35**\n- Voltage Gym: **Level 100**\nThe gym battle will start from the first slot of each team, eliminating one Pokemon per round until a team is wiped out.\n\n\nFor a deeper dive on fights, you can use **/battlesim** to mock a wild or gym battle.",
      "RequiresAdmin": false
    },
    {
      "Name": "events",
      "ShortString": "",
      "HelpString": "There are three different kinds of events: Pokemon Count, Stat Comparison, Special Spawns.\nEvent time are at: 02:00, 08:00, 14:00, and 20:00 UTC\n\n**__Pokemon Count__**\nThese events will give a specific category that users can choose to enter. Some examples are *Grass* types, *shiny*, or even *legendary*. By entering, your Pokedex will be searched for the criteria and will enter with the count of Pokemon you own that belong to the category. The winner of this event will receive 1x Masterball, second place will receive 5x Ultraballs, and third place will receive 10x Greatballs.\n\n**__Stat Comparison__**\nThis will give a specific statistic that will select a single Pokemon from your Dex. For example: the category could be the heaviest Pokemon you own. When entering, the heaviest Pokemon you own will be selected for your entry. The winner of this event will receive 1x Masterball, second place will receive 5x Ultraballs, and third place will receive 10x Greatballs.\n\n**__Special Spawns__**\nThis is where you can get Pokemon not obtainable through the means of **/spawn**. Categories include: starters, fossil Pokemon, Ultra Beasts, Paradox, and Legendary/Mythical Pokemon. Whichever category spawns during this event can only be caught with a __Masterball__.",
      "RequiresAdmin": false
    },
    {
      "Name": "update",
      "ShortString": "",
      "HelpString": "__3/23/2024__\n- Region rewards. Use **/help regionreward**\n- New **/invite** command\n- Random candy drops have been added to defeated spawns\n- Minor bug fixes and help updates\n\n__4/1/2024__\n- Added a 'RUN' option to wild fights\n- Fixed typos in help documentation\n\n__4/2/2024__\n- Trades are now available through the **/trade** command\n- Documentation updated\n- Performance enhancements\n\n__4/3/2024__\n- Daycare added! Get more info through **/help daycare**\n- True Pokedex added. Get more info through **/help pokedex**\n- You can now view your obtained Pokemon through **/mypokemon**\n- Updated shop to show owned amount of selected item\n\n__4/5/2024__\n- Removed the **/pokeinfo** Single Pokemon command\n- Added Pokemon details to the **/pokedex** Pokemon command (if registered)\n- Updated spawns to show Pokedex and Form Dex status\n- Updated some Pokemon names such as Squawkabilly\n- Fixed a bug with **/starter**\n- Fixed a bug with Gender Events\n- Fixed an internal error when deleting spawn messages\n- Other bug and error fixes\n- Updated trainer Pokemon that had height/weight calculated outside the 10% range\n- Updated event endings (behind the scenes work)\n\n__4/8/2024__\n- Added logic around immunity during wild fights\n- Change details when ordering through **/mypokemon**\n- Prevent double capturing and fighting on spawns/events\n- Fixed two bugs in regards to **/evolve**\n- Fixed a bug within **/shop**\n\n__4/11/2024__\n- Updated Paradox Pokemon to be rarity 5\n- Fixed a bug with Voltage gym leaders team members\n- Fixed evolved fossil Pokemon spawning in events\n\n__4/14/2024__\n- Added battle simulations! Use **/help battlesim** for details\n- Raised 'Select Amount' maximum to 25 for **/givecandy** and **/shop**\n- Fixed the images for Icy Snow Vivillon\n\n__Newest Update (4/20/2024)__\n- Spawned Pokemon will now run away after the alotted interaction time (60s)\n- Updated descriptions of scenarios within **/battlesim**\n- Update names for different Maushold forms\n- Fixed a bug where Tandemaus could not evolve into the Maushold (Three) Form\n- Update names for different Dudunsparce forms\n- Commands with a display will be deleted after timing out (usually 5m)\n- Handle non-existent command errors\n- Fixed White Flabebe evolution line\n- Fixed Milcery only able to evolve into one type of Alcremie",
      "RequiresAdmin": false
    }
  ]
}